tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "pivotal/tap"
tap "pyroscope-io/brew"
tap "romkatv/powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# ANother Tool for Language Recognition
brew "antlr"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Turn English phrases to C or C++ declarations
brew "cdecl"
# Top-like interface for container metrics
brew "ctop"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Java garbage collection visualization tool
brew "gcviewer"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Alternative to top/htop
brew "glances"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Command-line tool for generating regular expressions
brew "grex"
# GitHub Markdown previewer
brew "grip"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lazier way to manage everything docker
brew "lazydocker"
# Swiss Army Knife for macOS
brew "m-cli"
# Java-based project management
brew "maven"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@14"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Python dependency management tool
brew "pipenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Adds basic gemset support to rbenv
brew "rbenv-gemset"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tools for market analysis
brew "ta-lib"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Disk Usage/Free Utility
brew "muesli/tap/duf"
# Open source continuous profiling software
brew "pyroscope-io/brew/pyroscope"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# GPU-accelerated terminal emulator
cask "alacritty"
# # Redis desktop manager
# cask "another-redis-desktop-manager"
# Scriptable scratchpad for developers
cask "boop"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# GIT client
cask "fork"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Archive manager for data compression and backups
cask "rar"
# Text editor for code, markup and prose
cask "sublime-text"
# Configurable document editor that supports Markdown
cask "typora"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
