tap "adoptopenjdk/openjdk"
tap "buildpack/tap"
tap "derailed/k9s"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "openresty/brew"
tap "pivotal/tap"
tap "puma/puma"
# Automate deployment, configuration, and upgrading
brew "ansible"
# ANother Tool for Language Recognition
brew "antlr"
# Turn English phrases to C or C++ declarations
brew "cdecl"
# Top-like interface for container metrics
brew "ctop"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Command-line tool for generating regular expressions
brew "grex"
# GitHub Markdown previewer
brew "grip"
# The mind to rule processes of your development environment
brew "hivemind"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Swiss Army Knife for macOS
brew "m-cli"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql@5.7"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@10"
# Libraries for security-enabled client and server applications
brew "nss"
# Python dependency management tool
brew "pipenv"
# Draw UML diagrams
brew "plantuml"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Adds basic gemset support to rbenv
brew "rbenv-gemset"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Tools for market analysis
brew "ta-lib"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Scalable Web Platform by Extending NGINX with Lua
brew "openresty/brew/openresty"
brew "pivotal/tap/springboot"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "alfred"
cask "another-redis-desktop-manager"
cask "discord"
cask "font-hack-nerd-font"
cask "font-sourcecodepro-nerd-font"
cask "miro-formerly-realtimeboard"
cask "ngrok"
cask "notion"
cask "obs"
cask "switchhosts"
